#### Terraform Plan 📋

<details><summary>🛡️ Security Scan (tfsec)</summary>

✅ No security issues found!

</details>

<details><summary>🔐 Policy Compliance (checkov)</summary>

**Policy Compliance Summary:**
✅ Passed: 906
❌ Failed: 108

**Compliance Frameworks:**
⚠️ CIS AWS: 54 issues

⚠️ **Action Required:** Policy violations must be resolved.


</details>

<details><summary>📜 OPA Policy Validation (Conftest)</summary>

✅ OPA policy validation passed (or no policies defined)

</details>

<details><summary>💰 Cost Impact (Infracost)</summary>

ℹ️ **No cost estimation available**

This PR contains no resource additions or modifications that Infracost can estimate.

**Possible reasons:**
- Only resource deletions (cost savings)
- Configuration changes only (no billable resource changes)
- No infrastructure changes in tracked modules

💡 *Cost estimation will be available when adding or modifying billable AWS resources.*

</details>

<details><summary>Monitoring Module Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_chatbot_slack_channel_configuration.critical[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_chatbot_slack_channel_configuration" "critical" {
      - chat_configuration_arn      = "arn:aws:chatbot::646886795421:chat-configuration/slack-channel/prod-monitoring-alerts" -> null
      - configuration_name          = "prod-monitoring-alerts" -> null
      - guardrail_policy_arns       = [
          - "arn:aws:iam::aws:policy/ReadOnlyAccess",
        ] -> null
      - iam_role_arn                = "arn:aws:iam::646886795421:role/prod-monitoring-chatbot-role" -> null
      - logging_level               = "INFO" -> null
      - slack_channel_id            = (sensitive value) -> null
      - slack_channel_name          = "monitoring" -> null
      - slack_team_id               = (sensitive value) -> null
      - slack_team_name             = "Connectly" -> null
      - sns_topic_arns              = [
          - "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-critical",
          - "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-info",
          - "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-warning",
        ] -> null
      - tags                        = {
          - "Component"   = "alerting"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "internal"
          - "Description" = "Chatbot configuration for all severity level alerts"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "prod-monitoring-alerts"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "monitoring"
          - "Severity"    = "all"
          - "Team"        = "platform-team"
        } -> null
      - tags_all                    = {
          - "Component"   = "alerting"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "internal"
          - "Description" = "Chatbot configuration for all severity level alerts"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Module"      = "monitoring"
          - "Name"        = "prod-monitoring-alerts"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "monitoring"
          - "Severity"    = "all"
          - "Team"        = "platform-team"
        } -> null
      - user_authorization_required = false -> null
    }

  # aws_cloudwatch_log_group.adot-collector will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "adot-collector" {
        id                = "/aws/ecs/adot-collector"
        name              = "/aws/ecs/adot-collector"
      ~ tags              = {
            "Component"   = "adot"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
          - "Description" = "ADOT Collector container logs" -> null
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "prod-monitoring-adot-collector-logs"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "monitoring"
            "Team"        = "platform-team"
        }
      ~ tags_all          = {
          - "Description" = "ADOT Collector container logs" -> null
            # (12 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.amp-query-logs[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "amp-query-logs" {
        id                = "/aws/prometheus/infrastructure-metrics/query-logs"
        name              = "/aws/prometheus/infrastructure-metrics/query-logs"
      ~ tags              = {
            "Component"   = "amp"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
          - "Description" = "AMP query logs for troubleshooting and auditing" -> null
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "prod-monitoring-amp-query-logs"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "monitoring"
            "Team"        = "platform-team"
        }
      ~ tags_all          = {
          - "Description" = "AMP query logs for troubleshooting and auditing" -> null
            # (12 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.ecs-high-cpu-warning[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ecs-high-cpu-warning" {
      ~ alarm_actions             = [
          - "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-warning",
        ] -> (known after apply)
        id                        = "prod-monitoring-ecs-high-cpu-warning"
      ~ ok_actions                = [
          - "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-info",
        ] -> (known after apply)
        tags                      = {
            "Component"   = "alerting"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "prod-monitoring-ecs-high-cpu-warning"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Resource"    = "ECS"
            "Service"     = "monitoring"
            "Severity"    = "warning"
            "Team"        = "platform-team"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.ecs-high-memory-critical[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ecs-high-memory-critical" {
      ~ alarm_actions             = [
          - "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-critical",
        ] -> (known after apply)
        id                        = "prod-monitoring-ecs-high-memory-critical"
      ~ ok_actions                = [
          - "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-info",
        ] -> (known after apply)
        tags                      = {
            "Component"   = "alerting"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "prod-monitoring-ecs-high-memory-critical"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Resource"    = "ECS"
            "Service"     = "monitoring"
            "Severity"    = "critical"
            "Team"        = "platform-team"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.ecs-high-memory-warning[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ecs-high-memory-warning" {
      ~ alarm_actions             = [
          - "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-warning",
        ] -> (known after apply)
        id                        = "prod-monitoring-ecs-high-memory-warning"
      ~ ok_actions                = [
          - "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-info",
        ] -> (known after apply)
        tags                      = {
            "Component"   = "alerting"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "prod-monitoring-ecs-high-memory-warning"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Resource"    = "ECS"
            "Service"     = "monitoring"
            "Severity"    = "warning"
            "Team"        = "platform-team"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.ecs-task-count-zero[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ecs-task-count-zero" {
      ~ alarm_actions             = [
          - "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-critical",
        ] -> (known after apply)
        id                        = "prod-monitoring-ecs-task-count-zero"
      ~ ok_actions                = [
          - "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-info",
        ] -> (known after apply)
        tags                      = {
            "Component"   = "alerting"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "prod-monitoring-ecs-task-count-zero"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Resource"    = "ECS"
            "Service"     = "monitoring"
            "Severity"    = "critical"
            "Team"        = "platform-team"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_grafana_workspace.main will be updated in-place
  ~ resource "aws_grafana_workspace" "main" {
        id                        = "g-13d0f6f6be"
        name                      = "prod-monitoring-infrastructure-observability"
      ~ role_arn                  = "arn:aws:iam::646886795421:role/prod-monitoring-grafana-workspace-role" -> (known after apply)
        tags                      = {
            "Component"   = "amg"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "Amazon Managed Grafana workspace for infrastructure observability"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "prod-monitoring-amg"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "monitoring"
            "Team"        = "platform-team"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.chatbot[0] will be destroyed
  # (because aws_iam_role.chatbot is not in configuration)
  - resource "aws_iam_role" "chatbot" {
      - arn                   = "arn:aws:iam::646886795421:role/prod-monitoring-chatbot-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "chatbot.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-10-14T05:38:48Z" -> null
      - description           = "IAM role for AWS Chatbot to send notifications to Slack" -> null
      - force_detach_policies = false -> null
      - id                    = "prod-monitoring-chatbot-role" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "prod-monitoring-chatbot-role" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Component"   = "alerting"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "internal"
          - "Description" = "IAM role for AWS Chatbot Slack integration"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "prod-monitoring-chatbot-role"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "monitoring"
          - "Team"        = "platform-team"
        } -> null
      - tags_all              = {
          - "Component"   = "alerting"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "internal"
          - "Description" = "IAM role for AWS Chatbot Slack integration"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Module"      = "monitoring"
          - "Name"        = "prod-monitoring-chatbot-role"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "monitoring"
          - "Team"        = "platform-team"
        } -> null
      - unique_id             = "AROAZNHLVFCO2UTDQJLCT" -> null

      - inline_policy {
          - name   = "chatbot-cloudwatch-policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "cloudwatch:Describe*",
                              - "cloudwatch:Get*",
                              - "cloudwatch:List*",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                      - {
                          - Action   = [
                              - "logs:Get*",
                              - "logs:List*",
                              - "logs:StartQuery",
                              - "logs:StopQuery",
                              - "logs:TestMetricFilter",
                              - "logs:FilterLogEvents",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/ecs/*",
                              - "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/rds/*",
                              - "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/lambda/*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.ecs-amp-writer will be destroyed
  # (because aws_iam_role.ecs-amp-writer is not in configuration)
  - resource "aws_iam_role" "ecs-amp-writer" {
      - arn                   = "arn:aws:iam::646886795421:role/prod-monitoring-ecs-amp-writer" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-10-14T03:16:09Z" -> null
      - description           = "IAM role for ECS tasks to write metrics to Amazon Managed Prometheus" -> null
      - force_detach_policies = false -> null
      - id                    = "prod-monitoring-ecs-amp-writer" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "prod-monitoring-ecs-amp-writer" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Component"   = "iam"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "internal"
          - "Description" = "ECS task role for AMP remote write access"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "prod-monitoring-ecs-amp-writer"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "monitoring"
          - "Team"        = "platform-team"
        } -> null
      - tags_all              = {
          - "Component"   = "iam"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "internal"
          - "Description" = "ECS task role for AMP remote write access"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Module"      = "monitoring"
          - "Name"        = "prod-monitoring-ecs-amp-writer"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "monitoring"
          - "Team"        = "platform-team"
        } -> null
      - unique_id             = "AROAZNHLVFCO7QLTUAGFE" -> null

      - inline_policy {
          - name   = "adot-ecs-metrics-policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = [
                              - "ecs:DescribeTasks",
                              - "ecs:DescribeContainerInstances",
                            ]
                          - Condition = {
                              - StringEquals = {
                                  - "ecs:cluster" = "arn:aws:ecs:ap-northeast-2:646886795421:cluster/atlantis-prod"
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = "*"
                        },
                      - {
                          - Action   = [
                              - "ec2:DescribeInstances",
                              - "ec2:DescribeTags",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                      - {
                          - Action    = [
                              - "cloudwatch:PutMetricData",
                            ]
                          - Condition = {
                              - StringEquals = {
                                  - "cloudwatch:namespace" = [
                                      - "ECS/ContainerInsights",
                                      - "AWS/ECS",
                                    ]
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "amp-remote-write-policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "aps:RemoteWrite",
                              - "aps:GetSeries",
                              - "aps:GetLabels",
                              - "aps:GetMetricMetadata",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:aps:ap-northeast-2:646886795421:workspace/ws-df3ce6a3-a2b1-44a6-8fd3-3f698d75fcd8"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.grafana-amp-reader will be destroyed
  # (because aws_iam_role.grafana-amp-reader is not in configuration)
  - resource "aws_iam_role" "grafana-amp-reader" {
      - arn                   = "arn:aws:iam::646886795421:role/prod-monitoring-grafana-amp-reader" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "646886795421"
                            }
                          - StringLike   = {
                              - "aws:SourceArn" = "arn:aws:grafana:ap-northeast-2:646886795421:/workspaces/*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "grafana.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-10-14T03:16:09Z" -> null
      - description           = "IAM role for Grafana to query Amazon Managed Prometheus" -> null
      - force_detach_policies = false -> null
      - id                    = "prod-monitoring-grafana-amp-reader" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "prod-monitoring-grafana-amp-reader" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Component"   = "iam"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "internal"
          - "Description" = "Grafana role for AMP query access"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "prod-monitoring-grafana-amp-reader"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "monitoring"
          - "Team"        = "platform-team"
        } -> null
      - tags_all              = {
          - "Component"   = "iam"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "internal"
          - "Description" = "Grafana role for AMP query access"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Module"      = "monitoring"
          - "Name"        = "prod-monitoring-grafana-amp-reader"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "monitoring"
          - "Team"        = "platform-team"
        } -> null
      - unique_id             = "AROAZNHLVFCO3PGL4WSRZ" -> null

      - inline_policy {
          - name   = "amp-query-policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "aps:QueryMetrics",
                              - "aps:GetLabels",
                              - "aps:GetSeries",
                              - "aps:GetMetricMetadata",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:aps:ap-northeast-2:646886795421:workspace/ws-df3ce6a3-a2b1-44a6-8fd3-3f698d75fcd8"
                        },
                      - {
                          - Action   = [
                              - "aps:ListWorkspaces",
                              - "aps:DescribeWorkspace",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "cloudwatch-read-policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "cloudwatch:DescribeAlarmsForMetric",
                              - "cloudwatch:DescribeAlarmHistory",
                              - "cloudwatch:DescribeAlarms",
                              - "cloudwatch:ListMetrics",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                      - {
                          - Action    = [
                              - "cloudwatch:GetMetricStatistics",
                              - "cloudwatch:GetMetricData",
                              - "cloudwatch:GetMetricWidgetImage",
                            ]
                          - Condition = {
                              - StringEquals = {
                                  - "cloudwatch:namespace" = [
                                      - "AWS/ECS",
                                      - "AWS/RDS",
                                      - "AWS/ApplicationELB",
                                      - "ECS/ContainerInsights",
                                    ]
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = "*"
                        },
                      - {
                          - Action   = [
                              - "logs:DescribeLogGroups",
                              - "logs:GetLogGroupFields",
                              - "logs:StartQuery",
                              - "logs:StopQuery",
                              - "logs:GetQueryResults",
                              - "logs:GetLogEvents",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/ecs/*",
                              - "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/rds/*",
                              - "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/lambda/*",
                            ]
                        },
                      - {
                          - Action   = [
                              - "ec2:DescribeTags",
                              - "ec2:DescribeInstances",
                              - "ec2:DescribeRegions",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                      - {
                          - Action   = [
                              - "tag:GetResources",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.grafana-workspace will be destroyed
  # (because aws_iam_role.grafana-workspace is not in configuration)
  - resource "aws_iam_role" "grafana-workspace" {
      - arn                   = "arn:aws:iam::646886795421:role/prod-monitoring-grafana-workspace-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "grafana.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-10-14T03:20:14Z" -> null
      - force_detach_policies = false -> null
      - id                    = "prod-monitoring-grafana-workspace-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonPrometheusQueryAccess",
          - "arn:aws:iam::aws:policy/CloudWatchReadOnlyAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "prod-monitoring-grafana-workspace-role" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Component"   = "iam"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "internal"
          - "Description" = "IAM role for Grafana workspace"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "prod-monitoring-grafana-workspace-role"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "monitoring"
          - "Team"        = "platform-team"
        } -> null
      - tags_all              = {
          - "Component"   = "iam"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "internal"
          - "Description" = "IAM role for Grafana workspace"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Module"      = "monitoring"
          - "Name"        = "prod-monitoring-grafana-workspace-role"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "monitoring"
          - "Team"        = "platform-team"
        } -> null
      - unique_id             = "AROAZNHLVFCOW5RLKMRZ4" -> null
    }

  # aws_iam_role_policy.adot-ecs-metrics will be destroyed
  # (because aws_iam_role_policy.adot-ecs-metrics is not in configuration)
  - resource "aws_iam_role_policy" "adot-ecs-metrics" {
      - id     = "prod-monitoring-ecs-amp-writer:adot-ecs-metrics-policy" -> null
      - name   = "adot-ecs-metrics-policy" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecs:DescribeTasks",
                          - "ecs:DescribeContainerInstances",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "ecs:cluster" = "arn:aws:ecs:ap-northeast-2:646886795421:cluster/atlantis-prod"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                  - {
                      - Action   = [
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action    = [
                          - "cloudwatch:PutMetricData",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "cloudwatch:namespace" = [
                                  - "ECS/ContainerInsights",
                                  - "AWS/ECS",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "prod-monitoring-ecs-amp-writer" -> null
    }

  # aws_iam_role_policy.amp-query will be destroyed
  # (because aws_iam_role_policy.amp-query is not in configuration)
  - resource "aws_iam_role_policy" "amp-query" {
      - id     = "prod-monitoring-grafana-amp-reader:amp-query-policy" -> null
      - name   = "amp-query-policy" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "aps:QueryMetrics",
                          - "aps:GetLabels",
                          - "aps:GetSeries",
                          - "aps:GetMetricMetadata",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:aps:ap-northeast-2:646886795421:workspace/ws-df3ce6a3-a2b1-44a6-8fd3-3f698d75fcd8"
                    },
                  - {
                      - Action   = [
                          - "aps:ListWorkspaces",
                          - "aps:DescribeWorkspace",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "prod-monitoring-grafana-amp-reader" -> null
    }

  # aws_iam_role_policy.amp-remote-write will be destroyed
  # (because aws_iam_role_policy.amp-remote-write is not in configuration)
  - resource "aws_iam_role_policy" "amp-remote-write" {
      - id     = "prod-monitoring-ecs-amp-writer:amp-remote-write-policy" -> null
      - name   = "amp-remote-write-policy" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "aps:RemoteWrite",
                          - "aps:GetSeries",
                          - "aps:GetLabels",
                          - "aps:GetMetricMetadata",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:aps:ap-northeast-2:646886795421:workspace/ws-df3ce6a3-a2b1-44a6-8fd3-3f698d75fcd8"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "prod-monitoring-ecs-amp-writer" -> null
    }

  # aws_iam_role_policy.chatbot-cloudwatch[0] will be destroyed
  # (because aws_iam_role_policy.chatbot-cloudwatch is not in configuration)
  - resource "aws_iam_role_policy" "chatbot-cloudwatch" {
      - id     = "prod-monitoring-chatbot-role:chatbot-cloudwatch-policy" -> null
      - name   = "chatbot-cloudwatch-policy" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudwatch:Describe*",
                          - "cloudwatch:Get*",
                          - "cloudwatch:List*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:Get*",
                          - "logs:List*",
                          - "logs:StartQuery",
                          - "logs:StopQuery",
                          - "logs:TestMetricFilter",
                          - "logs:FilterLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/ecs/*",
                          - "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/rds/*",
                          - "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/lambda/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "prod-monitoring-chatbot-role" -> null
    }

  # aws_iam_role_policy.cloudwatch-read will be destroyed
  # (because aws_iam_role_policy.cloudwatch-read is not in configuration)
  - resource "aws_iam_role_policy" "cloudwatch-read" {
      - id     = "prod-monitoring-grafana-amp-reader:cloudwatch-read-policy" -> null
      - name   = "cloudwatch-read-policy" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudwatch:DescribeAlarmsForMetric",
                          - "cloudwatch:DescribeAlarmHistory",
                          - "cloudwatch:DescribeAlarms",
                          - "cloudwatch:ListMetrics",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action    = [
                          - "cloudwatch:GetMetricStatistics",
                          - "cloudwatch:GetMetricData",
                          - "cloudwatch:GetMetricWidgetImage",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "cloudwatch:namespace" = [
                                  - "AWS/ECS",
                                  - "AWS/RDS",
                                  - "AWS/ApplicationELB",
                                  - "ECS/ContainerInsights",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:DescribeLogGroups",
                          - "logs:GetLogGroupFields",
                          - "logs:StartQuery",
                          - "logs:StopQuery",
                          - "logs:GetQueryResults",
                          - "logs:GetLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/ecs/*",
                          - "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/rds/*",
                          - "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/lambda/*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "ec2:DescribeTags",
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeRegions",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "tag:GetResources",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "prod-monitoring-grafana-amp-reader" -> null
    }

  # aws_kms_key.monitoring will be updated in-place
  ~ resource "aws_kms_key" "monitoring" {
        id                                 = "c989a9fe-f701-4bfa-9e5a-64d96a8dce71"
      ~ tags                               = {
            "Component"   = "kms"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
          - "Description" = "KMS key for monitoring system encryption" -> null
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "prod-monitoring-key"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "monitoring"
            "Team"        = "platform-team"
        }
      ~ tags_all                           = {
          - "Description" = "KMS key for monitoring system encryption" -> null
            # (12 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # aws_prometheus_workspace.main will be updated in-place
  ~ resource "aws_prometheus_workspace" "main" {
        id                  = "ws-df3ce6a3-a2b1-44a6-8fd3-3f698d75fcd8"
      ~ tags                = {
            "Component"   = "amp"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
          - "Description" = "Amazon Managed Prometheus workspace for infrastructure monitoring" -> null
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "prod-monitoring-amp"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "monitoring"
            "Team"        = "platform-team"
        }
      ~ tags_all            = {
          - "Description" = "Amazon Managed Prometheus workspace for infrastructure monitoring" -> null
            # (12 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_sns_topic.critical will be destroyed
  # (because aws_sns_topic.critical is not in configuration)
  - resource "aws_sns_topic" "critical" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-critical" -> null
      - content_based_deduplication              = false -> null
      - display_name                             = "Critical Alerts - prod" -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-critical" -> null
      - kms_master_key_id                        = "c989a9fe-f701-4bfa-9e5a-64d96a8dce71" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "prod-monitoring-critical" -> null
      - owner                                    = "646886795421" -> null
      - policy                                   = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "646886795421"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudwatch.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-critical"
                      - Sid       = "AllowCloudWatchToPublish"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - signature_version                        = 0 -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {
          - "Component"   = "alerting"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "internal"
          - "Description" = "P0 critical alerts requiring immediate response"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "prod-monitoring-critical"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "monitoring"
          - "Severity"    = "critical"
          - "Team"        = "platform-team"
        } -> null
      - tags_all                                 = {
          - "Component"   = "alerting"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "internal"
          - "Description" = "P0 critical alerts requiring immediate response"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Module"      = "monitoring"
          - "Name"        = "prod-monitoring-critical"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "monitoring"
          - "Severity"    = "critical"
          - "Team"        = "platform-team"
        } -> null
    }

  # aws_sns_topic.info will be destroyed
  # (because aws_sns_topic.info is not in configuration)
  - resource "aws_sns_topic" "info" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-info" -> null
      - content_based_deduplication              = false -> null
      - display_name                             = "Info Alerts - prod" -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-info" -> null
      - kms_master_key_id                        = "c989a9fe-f701-4bfa-9e5a-64d96a8dce71" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "prod-monitoring-info" -> null
      - owner                                    = "646886795421" -> null
      - policy                                   = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "646886795421"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudwatch.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-info"
                      - Sid       = "AllowCloudWatchToPublish"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - signature_version                        = 0 -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {
          - "Component"   = "alerting"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "internal"
          - "Description" = "P2 informational alerts for monitoring and analysis"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "prod-monitoring-info"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "monitoring"
          - "Severity"    = "info"
          - "Team"        = "platform-team"
        } -> null
      - tags_all                                 = {
          - "Component"   = "alerting"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "internal"
          - "Description" = "P2 informational alerts for monitoring and analysis"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Module"      = "monitoring"
          - "Name"        = "prod-monitoring-info"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "monitoring"
          - "Severity"    = "info"
          - "Team"        = "platform-team"
        } -> null
    }

  # aws_sns_topic.warning will be destroyed
  # (because aws_sns_topic.warning is not in configuration)
  - resource "aws_sns_topic" "warning" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-warning" -> null
      - content_based_deduplication              = false -> null
      - display_name                             = "Warning Alerts - prod" -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-warning" -> null
      - kms_master_key_id                        = "c989a9fe-f701-4bfa-9e5a-64d96a8dce71" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "prod-monitoring-warning" -> null
      - owner                                    = "646886795421" -> null
      - policy                                   = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "646886795421"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudwatch.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-warning"
                      - Sid       = "AllowCloudWatchToPublish"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - signature_version                        = 0 -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {
          - "Component"   = "alerting"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "internal"
          - "Description" = "P1 warning alerts requiring attention within 30 minutes"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "prod-monitoring-warning"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "monitoring"
          - "Severity"    = "warning"
          - "Team"        = "platform-team"
        } -> null
      - tags_all                                 = {
          - "Component"   = "alerting"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "internal"
          - "Description" = "P1 warning alerts requiring attention within 30 minutes"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Module"      = "monitoring"
          - "Name"        = "prod-monitoring-warning"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "monitoring"
          - "Severity"    = "warning"
          - "Team"        = "platform-team"
        } -> null
    }

  # aws_sns_topic_policy.critical will be destroyed
  # (because aws_sns_topic_policy.critical is not in configuration)
  - resource "aws_sns_topic_policy" "critical" {
      - arn    = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-critical" -> null
      - id     = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-critical" -> null
      - owner  = "646886795421" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "646886795421"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudwatch.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-critical"
                      - Sid       = "AllowCloudWatchToPublish"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # aws_sns_topic_policy.info will be destroyed
  # (because aws_sns_topic_policy.info is not in configuration)
  - resource "aws_sns_topic_policy" "info" {
      - arn    = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-info" -> null
      - id     = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-info" -> null
      - owner  = "646886795421" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "646886795421"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudwatch.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-info"
                      - Sid       = "AllowCloudWatchToPublish"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # aws_sns_topic_policy.warning will be destroyed
  # (because aws_sns_topic_policy.warning is not in configuration)
  - resource "aws_sns_topic_policy" "warning" {
      - arn    = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-warning" -> null
      - id     = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-warning" -> null
      - owner  = "646886795421" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "646886795421"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudwatch.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-warning"
                      - Sid       = "AllowCloudWatchToPublish"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # aws_ssm_parameter.adot-config will be updated in-place
  ~ resource "aws_ssm_parameter" "adot-config" {
        id          = "/prod/monitoring/adot-config"
        name        = "/prod/monitoring/adot-config"
      ~ tags        = {
            "Component"   = "adot"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
          - "Description" = "ADOT Collector configuration" -> null
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "prod-monitoring-adot-config"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "monitoring"
            "Team"        = "platform-team"
        }
      ~ tags_all    = {
          - "Description" = "ADOT Collector configuration" -> null
            # (12 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.iam_ecs_amp_writer.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for ECS tasks to write metrics to Amazon Managed Prometheus"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prod-monitoring-ecs-amp-writer"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-monitoring-ecs-amp-writer"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "monitoring"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Module"      = "monitoring"
          + "Name"        = "prod-monitoring-ecs-amp-writer"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "monitoring"
        }
      + unique_id             = (known after apply)
    }

  # module.iam_ecs_amp_writer.aws_iam_role_policy.custom["adot-ecs-metrics"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "prod-monitoring-ecs-amp-writer-adot-ecs-metrics"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecs:DescribeTasks",
                          + "ecs:DescribeContainerInstances",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "ecs:cluster" = "arn:aws:ecs:ap-northeast-2:646886795421:cluster/atlantis-prod"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "cloudwatch:PutMetricData",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "cloudwatch:namespace" = [
                                  + "ECS/ContainerInsights",
                                  + "AWS/ECS",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.iam_ecs_amp_writer.aws_iam_role_policy.custom["amp-remote-write"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "prod-monitoring-ecs-amp-writer-amp-remote-write"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "aps:RemoteWrite",
                          + "aps:GetSeries",
                          + "aps:GetLabels",
                          + "aps:GetMetricMetadata",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:aps:ap-northeast-2:646886795421:workspace/ws-df3ce6a3-a2b1-44a6-8fd3-3f698d75fcd8"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.iam_grafana_amp_reader.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + "aws:SourceAccount" = "646886795421"
                            }
                          + StringLike   = {
                              + "aws:SourceArn" = "arn:aws:grafana:ap-northeast-2:646886795421:/workspaces/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "grafana.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for Grafana to query Amazon Managed Prometheus"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prod-monitoring-grafana-amp-reader"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-monitoring-grafana-amp-reader"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "monitoring"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Module"      = "monitoring"
          + "Name"        = "prod-monitoring-grafana-amp-reader"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "monitoring"
        }
      + unique_id             = (known after apply)
    }

  # module.iam_grafana_amp_reader.aws_iam_role_policy.custom["amp-query"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "prod-monitoring-grafana-amp-reader-amp-query"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "aps:QueryMetrics",
                          + "aps:GetLabels",
                          + "aps:GetSeries",
                          + "aps:GetMetricMetadata",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:aps:ap-northeast-2:646886795421:workspace/ws-df3ce6a3-a2b1-44a6-8fd3-3f698d75fcd8"
                    },
                  + {
                      + Action   = [
                          + "aps:ListWorkspaces",
                          + "aps:DescribeWorkspace",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.iam_grafana_amp_reader.aws_iam_role_policy.custom["cloudwatch-read"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "prod-monitoring-grafana-amp-reader-cloudwatch-read"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "cloudwatch:DescribeAlarmsForMetric",
                          + "cloudwatch:DescribeAlarmHistory",
                          + "cloudwatch:DescribeAlarms",
                          + "cloudwatch:ListMetrics",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "cloudwatch:GetMetricStatistics",
                          + "cloudwatch:GetMetricData",
                          + "cloudwatch:GetMetricWidgetImage",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "cloudwatch:namespace" = [
                                  + "AWS/ECS",
                                  + "AWS/RDS",
                                  + "AWS/ApplicationELB",
                                  + "ECS/ContainerInsights",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:DescribeLogGroups",
                          + "logs:GetLogGroupFields",
                          + "logs:StartQuery",
                          + "logs:StopQuery",
                          + "logs:GetQueryResults",
                          + "logs:GetLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/ecs/*",
                          + "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/rds/*",
                          + "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/lambda/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeTags",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeRegions",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "tag:GetResources",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.iam_grafana_workspace.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "grafana.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for Grafana workspace"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prod-monitoring-grafana-workspace-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-monitoring-grafana-workspace-role"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "monitoring"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Module"      = "monitoring"
          + "Name"        = "prod-monitoring-grafana-workspace-role"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "monitoring"
        }
      + unique_id             = (known after apply)
    }

  # module.sns_critical.aws_sns_topic.this will be created
  + resource "aws_sns_topic" "this" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + display_name                = "Critical Alerts - prod"
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "c989a9fe-f701-4bfa-9e5a-64d96a8dce71"
      + name                        = "prod-monitoring-critical"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Component"    = "alerting"
          + "CostCenter"   = "engineering"
          + "DataClass"    = "internal"
          + "Description"  = "P0 critical alerts requiring immediate response"
          + "Environment"  = "prod"
          + "KMSEncrypted" = "true"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "prod-monitoring-critical"
          + "Owner"        = "platform-team"
          + "Project"      = "infrastructure"
          + "Service"      = "monitoring"
          + "Severity"     = "critical"
          + "TopicType"    = "Standard"
        }
      + tags_all                    = {
          + "Component"    = "alerting"
          + "CostCenter"   = "engineering"
          + "DataClass"    = "internal"
          + "Description"  = "P0 critical alerts requiring immediate response"
          + "Environment"  = "prod"
          + "KMSEncrypted" = "true"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Module"       = "monitoring"
          + "Name"         = "prod-monitoring-critical"
          + "Owner"        = "platform-team"
          + "Project"      = "infrastructure"
          + "Service"      = "monitoring"
          + "Severity"     = "critical"
          + "TopicType"    = "Standard"
        }
      + tracing_config              = (known after apply)
    }

  # module.sns_critical.aws_sns_topic_policy.this[0] will be created
  + resource "aws_sns_topic_policy" "this" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "SNS:Publish"
                      + Condition = {
                          + StringEquals = {
                              + "aws:SourceAccount" = "646886795421"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-critical"
                      + Sid       = "AllowCloudWatchToPublish"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.sns_info.aws_sns_topic.this will be created
  + resource "aws_sns_topic" "this" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + display_name                = "Info Alerts - prod"
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "c989a9fe-f701-4bfa-9e5a-64d96a8dce71"
      + name                        = "prod-monitoring-info"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Component"    = "alerting"
          + "CostCenter"   = "engineering"
          + "DataClass"    = "internal"
          + "Description"  = "P2 informational alerts for monitoring and analysis"
          + "Environment"  = "prod"
          + "KMSEncrypted" = "true"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "prod-monitoring-info"
          + "Owner"        = "platform-team"
          + "Project"      = "infrastructure"
          + "Service"      = "monitoring"
          + "Severity"     = "info"
          + "TopicType"    = "Standard"
        }
      + tags_all                    = {
          + "Component"    = "alerting"
          + "CostCenter"   = "engineering"
          + "DataClass"    = "internal"
          + "Description"  = "P2 informational alerts for monitoring and analysis"
          + "Environment"  = "prod"
          + "KMSEncrypted" = "true"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Module"       = "monitoring"
          + "Name"         = "prod-monitoring-info"
          + "Owner"        = "platform-team"
          + "Project"      = "infrastructure"
          + "Service"      = "monitoring"
          + "Severity"     = "info"
          + "TopicType"    = "Standard"
        }
      + tracing_config              = (known after apply)
    }

  # module.sns_info.aws_sns_topic_policy.this[0] will be created
  + resource "aws_sns_topic_policy" "this" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "SNS:Publish"
                      + Condition = {
                          + StringEquals = {
                              + "aws:SourceAccount" = "646886795421"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-info"
                      + Sid       = "AllowCloudWatchToPublish"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.sns_warning.aws_sns_topic.this will be created
  + resource "aws_sns_topic" "this" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + display_name                = "Warning Alerts - prod"
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "c989a9fe-f701-4bfa-9e5a-64d96a8dce71"
      + name                        = "prod-monitoring-warning"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Component"    = "alerting"
          + "CostCenter"   = "engineering"
          + "DataClass"    = "internal"
          + "Description"  = "P1 warning alerts requiring attention within 30 minutes"
          + "Environment"  = "prod"
          + "KMSEncrypted" = "true"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "prod-monitoring-warning"
          + "Owner"        = "platform-team"
          + "Project"      = "infrastructure"
          + "Service"      = "monitoring"
          + "Severity"     = "warning"
          + "TopicType"    = "Standard"
        }
      + tags_all                    = {
          + "Component"    = "alerting"
          + "CostCenter"   = "engineering"
          + "DataClass"    = "internal"
          + "Description"  = "P1 warning alerts requiring attention within 30 minutes"
          + "Environment"  = "prod"
          + "KMSEncrypted" = "true"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Module"       = "monitoring"
          + "Name"         = "prod-monitoring-warning"
          + "Owner"        = "platform-team"
          + "Project"      = "infrastructure"
          + "Service"      = "monitoring"
          + "Severity"     = "warning"
          + "TopicType"    = "Standard"
        }
      + tracing_config              = (known after apply)
    }

  # module.sns_warning.aws_sns_topic_policy.this[0] will be created
  + resource "aws_sns_topic_policy" "this" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "SNS:Publish"
                      + Condition = {
                          + StringEquals = {
                              + "aws:SourceAccount" = "646886795421"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-warning"
                      + Sid       = "AllowCloudWatchToPublish"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

Plan: 13 to add, 10 to change, 16 to destroy.

Changes to Outputs:
  ~ adot_collector_config_template = jsonencode(
        {
          - amp_endpoint    = "https://aps-workspaces.ap-northeast-2.amazonaws.com/workspaces/ws-df3ce6a3-a2b1-44a6-8fd3-3f698d75fcd8/api/v1/remote_write"
          - aws_region      = "ap-northeast-2"
          - iam_role_arn    = "arn:aws:iam::646886795421:role/prod-monitoring-ecs-amp-writer"
          - scrape_interval = "30s"
          - workspace_id    = "ws-df3ce6a3-a2b1-44a6-8fd3-3f698d75fcd8"
        }
    ) -> (known after apply)
  - chatbot_config_arn             = (sensitive value) -> null
  - chatbot_role_arn               = "arn:aws:iam::646886795421:role/prod-monitoring-chatbot-role" -> null
  ~ ecs_amp_writer_role_arn        = "arn:aws:iam::646886795421:role/prod-monitoring-ecs-amp-writer" -> (known after apply)
  ~ grafana_amp_reader_role_arn    = "arn:aws:iam::646886795421:role/prod-monitoring-grafana-amp-reader" -> (known after apply)
  ~ grafana_setup_info             = {
      ~ amp_reader_role_arn  = "arn:aws:iam::646886795421:role/prod-monitoring-grafana-amp-reader" -> (known after apply)
        # (3 unchanged attributes hidden)
    }
  + grafana_workspace_role_arn     = (known after apply)
  + grafana_workspace_role_name    = "prod-monitoring-grafana-workspace-role"
  ~ sns_topic_critical_arn         = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-critical" -> (known after apply)
  ~ sns_topic_info_arn             = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-info" -> (known after apply)
  ~ sns_topic_warning_arn          = "arn:aws:sns:ap-northeast-2:646886795421:prod-monitoring-warning" -> (known after apply)

```

</details>

<details><summary>Atlantis Module Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.atlantis will be destroyed
  # (because aws_cloudwatch_log_group.atlantis is not in configuration)
  - resource "aws_cloudwatch_log_group" "atlantis" {
      - arn               = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/atlantis-prod" -> null
      - id                = "/ecs/atlantis-prod" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/atlantis-prod" -> null
      - retention_in_days = 7 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "CloudWatch log group for Atlantis ECS tasks"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all          = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "CloudWatch log group for Atlantis ECS tasks"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
    }

  # aws_ecr_lifecycle_policy.atlantis will be destroyed
  # (because aws_ecr_lifecycle_policy.atlantis is not in configuration)
  - resource "aws_ecr_lifecycle_policy" "atlantis" {
      - id          = "atlantis" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Keep last 10 images"
                      - rulePriority = 1
                      - selection    = {
                          - countNumber   = 10
                          - countType     = "imageCountMoreThan"
                          - tagPrefixList = [
                              - "v",
                            ]
                          - tagStatus     = "tagged"
                        }
                    },
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Remove untagged images after 7 days"
                      - rulePriority = 2
                      - selection    = {
                          - countNumber = 7
                          - countType   = "sinceImagePushed"
                          - countUnit   = "days"
                          - tagStatus   = "untagged"
                        }
                    },
                ]
            }
        ) -> null
      - registry_id = "646886795421" -> null
      - repository  = "atlantis" -> null
    }

  # aws_ecr_repository.atlantis will be destroyed
  # (because aws_ecr_repository.atlantis is not in configuration)
  - resource "aws_ecr_repository" "atlantis" {
      - arn                  = "arn:aws:ecr:ap-northeast-2:646886795421:repository/atlantis" -> null
      - id                   = "atlantis" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "atlantis" -> null
      - registry_id          = "646886795421" -> null
      - repository_url       = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/atlantis" -> null
      - tags                 = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Docker images for Atlantis Terraform automation server"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all             = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Docker images for Atlantis Terraform automation server"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null

      - encryption_configuration {
          - encryption_type = "KMS" -> null
          - kms_key         = "arn:aws:kms:ap-northeast-2:646886795421:key/fb74c860-dfb9-498f-9937-976a098b103c" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # aws_ecr_repository_policy.atlantis will be destroyed
  # (because aws_ecr_repository_policy.atlantis is not in configuration)
  - resource "aws_ecr_repository_policy" "atlantis" {
      - id          = "atlantis" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                          - "ecr:PutImage",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:UploadLayerPart",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:DescribeImages",
                          - "ecr:ListImages",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::646886795421:root"
                        }
                      - Sid       = "AllowPushPull"
                    },
                  - {
                      - Action    = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                      - Sid       = "AllowECSTaskExecution"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - registry_id = "646886795421" -> null
      - repository  = "atlantis" -> null
    }

  # aws_ecs_cluster.atlantis will be updated in-place
  ~ resource "aws_ecs_cluster" "atlantis" {
        id       = "arn:aws:ecs:ap-northeast-2:646886795421:cluster/atlantis-prod"
        name     = "atlantis-prod"
      ~ tags     = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS cluster for Atlantis Terraform automation server"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_service.atlantis will be updated in-place
  ~ resource "aws_ecs_service" "atlantis" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/atlantis-prod/atlantis-prod"
        name                               = "atlantis-prod"
      ~ tags                               = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS service for Atlantis Terraform automation server"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                           = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/atlantis-prod:9" -> (known after apply)
        # (15 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "atlantis" -> null
          - container_port   = 4141 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/atl-20251011072359287200000001/2c46e9934484e453" -> null
        }
      + load_balancer {
          + container_name   = "atlantis"
          + container_port   = 4141
          + target_group_arn = (known after apply)
        }

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-09eda99303e72ca2d",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.atlantis must be replaced
-/+ resource "aws_ecs_task_definition" "atlantis" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/atlantis-prod:8" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/atlantis-prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "ATLANTIS_ATLANTIS_URL"
                          - value = "https://atlantis.set-of.com"
                        },
                      - {
                          - name  = "ATLANTIS_LOG_LEVEL"
                          - value = "debug"
                        },
                      - {
                          - name  = "ATLANTIS_PORT"
                          - value = "4141"
                        },
                      - {
                          - name  = "ATLANTIS_REPO_ALLOWLIST"
                          - value = "github.com/ryu-qqq/*"
                        },
                      - {
                          - name  = "ATLANTIS_REPO_CONFIG"
                          - value = "/home/atlantis/repos.yaml"
                        },
                      - {
                          - name  = "ATLANTIS_WRITE_GIT_CREDS"
                          - value = "true"
                        },
                    ]
                  - essential        = true
                  - healthCheck      = {
                      - command     = [
                          - "CMD-SHELL",
                          - "curl -f http://localhost:4141/healthz || exit 1",
                        ]
                      - interval    = 30
                      - retries     = 3
                      - startPeriod = 60
                      - timeout     = 5
                    }
                  - image            = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/atlantis:v0.30.0"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/atlantis-prod"
                          - awslogs-region        = "ap-northeast-2"
                          - awslogs-stream-prefix = "atlantis"
                        }
                    }
                  - mountPoints      = [
                      - {
                          - containerPath = "/home/atlantis/.atlantis"
                          - readOnly      = false
                          - sourceVolume  = "atlantis-data"
                        },
                    ]
                  - name             = "atlantis"
                  - portMappings     = [
                      - {
                          - containerPort = 4141
                          - hostPort      = 4141
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "ATLANTIS_GH_APP_ID"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt:app_id::"
                        },
                      - {
                          - name      = "ATLANTIS_GH_APP_INSTALLATION_ID"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt:installation_id::"
                        },
                      - {
                          - name      = "ATLANTIS_GH_APP_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt:private_key::"
                        },
                      - {
                          - name      = "ATLANTIS_GH_WEBHOOK_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7:webhook_secret::"
                        },
                    ]
                  - systemControls   = []
                  - ulimits          = [
                      - {
                          - hardLimit = 65536
                          - name      = "nofile"
                          - softLimit = 65536
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ execution_role_arn       = "arn:aws:iam::646886795421:role/atlantis-ecs-task-execution-prod" # forces replacement -> (known after apply) # forces replacement
      ~ id                       = "atlantis-prod" -> (known after apply)
      ~ revision                 = 8 -> (known after apply)
      ~ tags                     = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS task definition for Atlantis Terraform automation server"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                 = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
      ~ task_role_arn            = "arn:aws:iam::646886795421:role/atlantis-ecs-task-prod" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "atlantis-data" -> null

          - efs_volume_configuration {
              - file_system_id          = "fs-0404558fae26deb97" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 2049 -> null

              - authorization_config {
                  - access_point_id = "fsap-015fe847f3b144192" -> null
                  - iam             = "ENABLED" -> null
                }
            }
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "atlantis-data"

          + efs_volume_configuration {
              + file_system_id          = "fs-0404558fae26deb97"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 2049

              + authorization_config {
                  + access_point_id = "fsap-015fe847f3b144192"
                  + iam             = "ENABLED"
                }
            }
        }
    }

  # aws_efs_access_point.atlantis will be updated in-place
  ~ resource "aws_efs_access_point" "atlantis" {
        id              = "fsap-015fe847f3b144192"
      ~ tags            = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "EFS access point for Atlantis data directory"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all        = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_efs_file_system.atlantis will be updated in-place
  ~ resource "aws_efs_file_system" "atlantis" {
        id                              = "fs-0404558fae26deb97"
        name                            = "atlantis-prod"
      ~ tags                            = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "EFS file system for Atlantis persistent data storage"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                        = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_efs_mount_target.atlantis[0] will be updated in-place
  ~ resource "aws_efs_mount_target" "atlantis" {
        id                     = "fsmt-06087026eb674dc79"
      ~ security_groups        = [
          - "sg-00b4a4594212637d2",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_efs_mount_target.atlantis[1] will be updated in-place
  ~ resource "aws_efs_mount_target" "atlantis" {
        id                     = "fsmt-0ff0dbacfb68b58e7"
      ~ security_groups        = [
          - "sg-00b4a4594212637d2",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_iam_role.ecs-task will be destroyed
  # (because aws_iam_role.ecs-task is not in configuration)
  - resource "aws_iam_role" "ecs-task" {
      - arn                   = "arn:aws:iam::646886795421:role/atlantis-ecs-task-prod" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-10-11T07:23:59Z" -> null
      - force_detach_policies = false -> null
      - id                    = "atlantis-ecs-task-prod" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "atlantis-ecs-task-prod" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "ECS task role for Atlantis Terraform operations"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-ecs-task-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all              = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "ECS task role for Atlantis Terraform operations"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-ecs-task-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - unique_id             = "AROAZNHLVFCOTG24CDXY7" -> null

      - inline_policy {
          - name   = "AdditionalFileflowPermissions" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:ListTagsForResource",
                              - "logs:TagResource",
                              - "logs:UntagResource",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "CloudWatchLogsTagManagement"
                        },
                      - {
                          - Action    = [
                              - "kms:Encrypt",
                              - "kms:Decrypt",
                              - "kms:GenerateDataKey",
                              - "kms:CreateGrant",
                            ]
                          - Condition = {
                              - StringEquals = {
                                  - "kms:ViaService" = [
                                      - "secretsmanager.ap-northeast-2.amazonaws.com",
                                    ]
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = "*"
                          - Sid       = "KMSSecretsManagerAccess"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "ApplicationAutoScalingPermissions" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "application-autoscaling:RegisterScalableTarget",
                              - "application-autoscaling:DeregisterScalableTarget",
                              - "application-autoscaling:DescribeScalableTargets",
                              - "application-autoscaling:PutScalingPolicy",
                              - "application-autoscaling:DeleteScalingPolicy",
                              - "application-autoscaling:DescribeScalingPolicies",
                              - "application-autoscaling:TagResource",
                              - "application-autoscaling:UntagResource",
                              - "application-autoscaling:ListTagsForResource",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "ApplicationAutoScalingManagement"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "CloudWatchAlarmsPermissions" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "cloudwatch:DescribeAlarms",
                              - "cloudwatch:PutMetricAlarm",
                              - "cloudwatch:DeleteAlarms",
                              - "cloudwatch:ListTagsForResource",
                              - "cloudwatch:TagResource",
                              - "cloudwatch:UntagResource",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "CloudWatchAlarmsManagement"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "atlantis-assume-target-role" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "sts:AssumeRole"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:iam::646886795421:role/atlantis-target-prod"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "atlantis-cloudwatch-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvents",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/atlantis-prod:*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "atlantis-efs-access" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = [
                              - "elasticfilesystem:ClientMount",
                              - "elasticfilesystem:ClientWrite",
                              - "elasticfilesystem:ClientRootAccess",
                            ]
                          - Condition = {
                              - StringEquals = {
                                  - "elasticfilesystem:AccessPointArn" = "arn:aws:elasticfilesystem:ap-northeast-2:646886795421:access-point/fsap-015fe847f3b144192"
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = "arn:aws:elasticfilesystem:ap-northeast-2:646886795421:file-system/fs-0404558fae26deb97"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "atlantis-terraform-operations" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "s3:ListBucket",
                              - "s3:GetObject",
                              - "s3:PutObject",
                              - "s3:DeleteObject",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::terraform-state-*",
                              - "arn:aws:s3:::terraform-state-*/*",
                              - "arn:aws:s3:::prod-connectly",
                              - "arn:aws:s3:::prod-connectly/*",
                            ]
                          - Sid      = "TerraformStateAccess"
                        },
                      - {
                          - Action   = [
                              - "dynamodb:GetItem",
                              - "dynamodb:PutItem",
                              - "dynamodb:DeleteItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:dynamodb:*:646886795421:table/prod-connectly-tf-lock",
                              - "arn:aws:dynamodb:*:646886795421:table/prod-connectly-tf-lock",
                            ]
                          - Sid      = "DynamoDBLocking"
                        },
                      - {
                          - Action   = [
                              - "ec2:Describe*",
                              - "ec2:DescribeVpcEndpoints",
                              - "ecs:Describe*",
                              - "ecr:Describe*",
                              - "ecr:DescribeRepositories",
                              - "ecr:GetLifecyclePolicy",
                              - "ecr:GetRepositoryPolicy",
                              - "ecr:ListTagsForResource",
                              - "elasticloadbalancing:Describe*",
                              - "elasticache:DescribeCacheSubnetGroups",
                              - "elasticache:DescribeCacheParameterGroups",
                              - "elasticache:DescribeCacheParameters",
                              - "elasticache:DescribeCacheClusters",
                              - "elasticache:ListTagsForResource",
                              - "elasticfilesystem:Describe*",
                              - "elasticfilesystem:DescribeFileSystems",
                              - "elasticfilesystem:DescribeFileSystemPolicy",
                              - "elasticfilesystem:DescribeAccessPoints",
                              - "elasticfilesystem:DescribeMountTargets",
                              - "kms:Describe*",
                              - "kms:List*",
                              - "kms:GetKeyPolicy",
                              - "kms:GetKeyRotationStatus",
                              - "logs:Describe*",
                              - "logs:ListTagsForResource",
                              - "rds:DescribeDBSubnetGroups",
                              - "rds:DescribeDBParameterGroups",
                              - "rds:DescribeDBParameters",
                              - "rds:DescribeDBInstances",
                              - "rds:ListTagsForResource",
                              - "secretsmanager:DescribeSecret",
                              - "secretsmanager:GetResourcePolicy",
                              - "secretsmanager:GetSecretValue",
                              - "secretsmanager:ListSecretVersionIds",
                              - "s3:List*",
                              - "sqs:GetQueueAttributes",
                              - "sqs:GetQueueUrl",
                              - "sqs:ListQueues",
                              - "sqs:ListQueueTags",
                              - "ssm:GetParameter",
                              - "ssm:GetParameters",
                              - "ssm:DescribeParameters",
                              - "ssm:ListTagsForResource",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "TerraformPlanOperations"
                        },
                      - {
                          - Action   = [
                              - "iam:GetRole",
                              - "iam:GetRolePolicy",
                              - "iam:GetPolicy",
                              - "iam:GetPolicyVersion",
                              - "iam:ListRoles",
                              - "iam:ListRolePolicies",
                              - "iam:ListAttachedRolePolicies",
                              - "iam:ListPolicyVersions",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "IAMReadOnlyForTerraformResources"
                        },
                      - {
                          - Action   = [
                              - "iam:ListOpenIDConnectProviders",
                              - "iam:GetOpenIDConnectProvider",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "IAMOIDCProviderReadOnly"
                        },
                      - {
                          - Action   = [
                              - "iam:PutRolePolicy",
                              - "iam:DeleteRolePolicy",
                              - "iam:GetRolePolicy",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:iam::646886795421:role/fileflow-prod-*"
                          - Sid      = "ManageECSRoles"
                        },
                      - {
                          - Action   = [
                              - "ec2:DescribeSecurityGroups",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "DescribeSecurityGroups"
                        },
                      - {
                          - Action    = [
                              - "ec2:CreateSecurityGroup",
                              - "ec2:DeleteSecurityGroup",
                              - "ec2:AuthorizeSecurityGroupIngress",
                              - "ec2:AuthorizeSecurityGroupEgress",
                              - "ec2:RevokeSecurityGroupIngress",
                              - "ec2:RevokeSecurityGroupEgress",
                              - "ec2:CreateTags",
                            ]
                          - Condition = {
                              - StringLike = {
                                  - "aws:RequestTag/Service" = "fileflow"
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = [
                              - "arn:aws:ec2:ap-northeast-2:646886795421:security-group/*",
                              - "arn:aws:ec2:ap-northeast-2:646886795421:vpc/*",
                            ]
                          - Sid       = "ManageFileFlowSecurityGroups"
                        },
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                              - "logs:DeleteLogGroup",
                              - "logs:DescribeLogGroups",
                              - "logs:PutRetentionPolicy",
                              - "logs:TagResource",
                              - "logs:TagLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/ecs/*"
                          - Sid      = "ManageCloudWatchLogs"
                        },
                      - {
                          - Action   = [
                              - "elasticloadbalancing:DescribeTargetGroups",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "DescribeTargetGroups"
                        },
                      - {
                          - Action   = [
                              - "elasticloadbalancing:ModifyTargetGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/fileflow-*/*"
                          - Sid      = "ManageFileFlowTargetGroups"
                        },
                      - {
                          - Action   = [
                              - "s3:GetBucketPolicy",
                              - "s3:PutBucketPolicy",
                              - "s3:DeleteBucketPolicy",
                              - "s3:GetBucketAcl",
                              - "s3:PutBucketAcl",
                              - "s3:GetBucketVersioning",
                              - "s3:PutBucketVersioning",
                              - "s3:GetBucketLogging",
                              - "s3:PutBucketLogging",
                              - "s3:GetEncryptionConfiguration",
                              - "s3:PutEncryptionConfiguration",
                              - "s3:GetBucketPublicAccessBlock",
                              - "s3:PutBucketPublicAccessBlock",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::fileflow-*"
                          - Sid      = "ManageS3Buckets"
                        },
                      - {
                          - Action   = [
                              - "ec2:CreateSecurityGroup",
                              - "ec2:DeleteSecurityGroup",
                              - "ec2:AuthorizeSecurityGroupIngress",
                              - "ec2:AuthorizeSecurityGroupEgress",
                              - "ec2:RevokeSecurityGroupIngress",
                              - "ec2:RevokeSecurityGroupEgress",
                              - "ec2:CreateTags",
                              - "ec2:DeleteTags",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:ec2:ap-northeast-2:646886795421:security-group/*",
                              - "arn:aws:ec2:ap-northeast-2:646886795421:vpc/*",
                            ]
                          - Sid      = "ManageSecurityGroups"
                        },
                      - {
                          - Action   = [
                              - "elasticache:CreateCacheSubnetGroup",
                              - "elasticache:DeleteCacheSubnetGroup",
                              - "elasticache:ModifyCacheSubnetGroup",
                              - "elasticache:CreateReplicationGroup",
                              - "elasticache:DeleteReplicationGroup",
                              - "elasticache:ModifyReplicationGroup",
                              - "elasticache:AddTagsToResource",
                              - "elasticache:RemoveTagsFromResource",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "ManageElastiCache"
                        },
                      - {
                          - Action   = [
                              - "sqs:CreateQueue",
                              - "sqs:DeleteQueue",
                              - "sqs:SetQueueAttributes",
                              - "sqs:TagQueue",
                              - "sqs:UntagQueue",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:sqs:ap-northeast-2:646886795421:*"
                          - Sid      = "ManageSQS"
                        },
                      - {
                          - Action   = [
                              - "cloudwatch:PutMetricAlarm",
                              - "cloudwatch:DeleteAlarms",
                              - "cloudwatch:DescribeAlarms",
                              - "cloudwatch:TagResource",
                              - "cloudwatch:UntagResource",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:*"
                          - Sid      = "ManageCloudWatchAlarms"
                        },
                      - {
                          - Action   = [
                              - "ecs:CreateCluster",
                              - "ecs:DeleteCluster",
                              - "ecs:UpdateCluster",
                              - "ecs:RegisterTaskDefinition",
                              - "ecs:DeregisterTaskDefinition",
                              - "ecs:CreateService",
                              - "ecs:UpdateService",
                              - "ecs:DeleteService",
                              - "ecs:TagResource",
                              - "ecs:UntagResource",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "ManageECS"
                        },
                      - {
                          - Action   = [
                              - "iam:CreateRole",
                              - "iam:DeleteRole",
                              - "iam:AttachRolePolicy",
                              - "iam:DetachRolePolicy",
                              - "iam:PutRolePolicy",
                              - "iam:DeleteRolePolicy",
                              - "iam:PassRole",
                              - "iam:TagRole",
                              - "iam:UntagRole",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:iam::646886795421:role/fileflow-*",
                              - "arn:aws:iam::646886795421:role/atlantis-*",
                            ]
                          - Sid      = "ManageIAMRoles"
                        },
                      - {
                          - Action   = [
                              - "elasticloadbalancing:CreateLoadBalancer",
                              - "elasticloadbalancing:DeleteLoadBalancer",
                              - "elasticloadbalancing:CreateTargetGroup",
                              - "elasticloadbalancing:DeleteTargetGroup",
                              - "elasticloadbalancing:CreateListener",
                              - "elasticloadbalancing:DeleteListener",
                              - "elasticloadbalancing:ModifyListener",
                              - "elasticloadbalancing:ModifyTargetGroupAttributes",
                              - "elasticloadbalancing:ModifyLoadBalancerAttributes",
                              - "elasticloadbalancing:AddTags",
                              - "elasticloadbalancing:RemoveTags",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "ManageLoadBalancers"
                        },
                      - {
                          - Action   = [
                              - "ecr:CreateRepository",
                              - "ecr:DeleteRepository",
                              - "ecr:PutLifecyclePolicy",
                              - "ecr:DeleteLifecyclePolicy",
                              - "ecr:SetRepositoryPolicy",
                              - "ecr:DeleteRepositoryPolicy",
                              - "ecr:TagResource",
                              - "ecr:UntagResource",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:ecr:ap-northeast-2:646886795421:repository/*"
                          - Sid      = "ManageECR"
                        },
                      - {
                          - Action   = [
                              - "elasticache:CreateCacheParameterGroup",
                              - "elasticache:DeleteCacheParameterGroup",
                              - "elasticache:ModifyCacheParameterGroup",
                              - "elasticache:DescribeReplicationGroups",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "ManageElastiCacheParameters"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.ecs-task-execution will be destroyed
  # (because aws_iam_role.ecs-task-execution is not in configuration)
  - resource "aws_iam_role" "ecs-task-execution" {
      - arn                   = "arn:aws:iam::646886795421:role/atlantis-ecs-task-execution-prod" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-10-11T07:23:59Z" -> null
      - force_detach_policies = false -> null
      - id                    = "atlantis-ecs-task-execution-prod" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "atlantis-ecs-task-execution-prod" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "ECS task execution role for Atlantis"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-ecs-task-execution-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all              = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "ECS task execution role for Atlantis"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-ecs-task-execution-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - unique_id             = "AROAZNHLVFCOYFXARZBBF" -> null

      - inline_policy {
          - name   = "atlantis-ecs-task-execution-kms" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "kms:Decrypt",
                              - "kms:DescribeKey",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:kms:ap-northeast-2:646886795421:key/fb74c860-dfb9-498f-9937-976a098b103c"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "atlantis-ecs-task-execution-secrets" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "secretsmanager:GetSecretValue",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt",
                              - "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.atlantis-cloudwatch-logs will be destroyed
  # (because aws_iam_role_policy.atlantis-cloudwatch-logs is not in configuration)
  - resource "aws_iam_role_policy" "atlantis-cloudwatch-logs" {
      - id     = "atlantis-ecs-task-prod:atlantis-cloudwatch-logs" -> null
      - name   = "atlantis-cloudwatch-logs" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/atlantis-prod:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "atlantis-ecs-task-prod" -> null
    }

  # aws_iam_role_policy.atlantis-efs-access must be replaced
-/+ resource "aws_iam_role_policy" "atlantis-efs-access" {
      ~ id          = "atlantis-ecs-task-prod:atlantis-efs-access" -> (known after apply)
      ~ name        = "atlantis-efs-access" -> "efs-access" # forces replacement
      + name_prefix = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.atlantis-task-execution-kms will be created
  + resource "aws_iam_role_policy" "atlantis-task-execution-kms" {
      + id          = (known after apply)
      + name        = "kms-decryption"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:Decrypt",
                          + "kms:DescribeKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:ap-northeast-2:646886795421:key/fb74c860-dfb9-498f-9937-976a098b103c"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "atlantis-ecs-task-execution-prod"
    }

  # aws_iam_role_policy.atlantis-task-execution-secrets will be created
  + resource "aws_iam_role_policy" "atlantis-task-execution-secrets" {
      + id          = (known after apply)
      + name        = "secrets-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt",
                          + "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "atlantis-ecs-task-execution-prod"
    }

  # aws_iam_role_policy.atlantis-terraform-operations must be replaced
-/+ resource "aws_iam_role_policy" "atlantis-terraform-operations" {
      ~ id          = "atlantis-ecs-task-prod:atlantis-terraform-operations" -> (known after apply)
      ~ name        = "atlantis-terraform-operations" -> "terraform-operations" # forces replacement
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (1 unchanged element hidden)
                            "arn:aws:s3:::terraform-state-*/*",
                          - "arn:aws:s3:::prod-connectly",
                          - "arn:aws:s3:::prod-connectly/*",
                          + "arn:aws:s3:::prod-tfstate",
                          + "arn:aws:s3:::prod-tfstate/*",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Resource = [
                          - "arn:aws:dynamodb:*:646886795421:table/prod-connectly-tf-lock",
                          - "arn:aws:dynamodb:*:646886795421:table/prod-connectly-tf-lock",
                          + "arn:aws:dynamodb:*:646886795421:table/prod-tfstate-tf-lock",
                          + "arn:aws:dynamodb:*:646886795421:table/prod-tfstate-tf-lock",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Action   = [
                            "ec2:Describe*",
                          - "ec2:DescribeVpcEndpoints",
                            "ecs:Describe*",
                            "ecr:Describe*",
                          - "ecr:DescribeRepositories",
                          - "ecr:GetLifecyclePolicy",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:ListTagsForResource",
                            "elasticloadbalancing:Describe*",
                            # (5 unchanged elements hidden)
                            "elasticfilesystem:Describe*",
                          - "elasticfilesystem:DescribeFileSystems",
                          - "elasticfilesystem:DescribeFileSystemPolicy",
                          - "elasticfilesystem:DescribeAccessPoints",
                          - "elasticfilesystem:DescribeMountTargets",
                            "kms:Describe*",
                            # (23 unchanged elements hidden)
                        ]
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Action   = [
                            # (7 unchanged elements hidden)
                            "iam:ListPolicyVersions",
                          + "iam:ListOpenIDConnectProviders",
                          + "iam:GetOpenIDConnectProvider",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                  - {
                      - Action   = [
                          - "iam:ListOpenIDConnectProviders",
                          - "iam:GetOpenIDConnectProvider",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "IAMOIDCProviderReadOnly"
                    },
                    {
                        Action   = [
                            "iam:PutRolePolicy",
                            "iam:DeleteRolePolicy",
                            "iam:GetRolePolicy",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:iam::646886795421:role/fileflow-prod-*"
                        Sid      = "ManageECSRoles"
                    },
                  ~ {
                      ~ Action   = [
                            "ec2:DescribeSecurityGroups",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:DeleteSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:AuthorizeSecurityGroupEgress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupEgress",
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      ~ Resource = "*" -> [
                          + "arn:aws:ec2:ap-northeast-2:646886795421:security-group/*",
                          + "arn:aws:ec2:ap-northeast-2:646886795421:vpc/*",
                        ]
                      ~ Sid      = "DescribeSecurityGroups" -> "ManageSecurityGroups"
                        # (1 unchanged attribute hidden)
                    },
                  ~ {
                      ~ Action    = [
                          - "ec2:CreateSecurityGroup",
                          - "ec2:DeleteSecurityGroup",
                          - "ec2:AuthorizeSecurityGroupIngress",
                          - "ec2:AuthorizeSecurityGroupEgress",
                          - "ec2:RevokeSecurityGroupIngress",
                          - "ec2:RevokeSecurityGroupEgress",
                          - "ec2:CreateTags",
                          + "logs:CreateLogGroup",
                          + "logs:DeleteLogGroup",
                          + "logs:DescribeLogGroups",
                          + "logs:PutRetentionPolicy",
                          + "logs:DeleteRetentionPolicy",
                          + "logs:TagResource",
                          + "logs:TagLogGroup",
                          + "logs:UntagLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      - Condition = {
                          - StringLike = {
                              - "aws:RequestTag/Service" = "fileflow"
                            }
                        }
                      ~ Resource  = [
                          - "arn:aws:ec2:ap-northeast-2:646886795421:security-group/*",
                          - "arn:aws:ec2:ap-northeast-2:646886795421:vpc/*",
                        ] -> "*"
                      ~ Sid       = "ManageFileFlowSecurityGroups" -> "ManageCloudWatchLogs"
                        # (1 unchanged attribute hidden)
                    },
                  ~ {
                      ~ Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:DeleteLogGroup",
                          - "logs:DescribeLogGroups",
                          - "logs:PutRetentionPolicy",
                          - "logs:TagResource",
                          - "logs:TagLogGroup",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:ModifyTargetGroup",
                        ]
                      ~ Resource = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/ecs/*" -> "*"
                      ~ Sid      = "ManageCloudWatchLogs" -> "ManageTargetGroups"
                        # (1 unchanged attribute hidden)
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:DescribeTargetGroups",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "DescribeTargetGroups"
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:ModifyTargetGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/fileflow-*/*"
                      - Sid      = "ManageFileFlowTargetGroups"
                    },
                    {
                        Action   = [
                            "s3:GetBucketPolicy",
                            "s3:PutBucketPolicy",
                            "s3:DeleteBucketPolicy",
                            "s3:GetBucketAcl",
                            "s3:PutBucketAcl",
                            "s3:GetBucketVersioning",
                            "s3:PutBucketVersioning",
                            "s3:GetBucketLogging",
                            "s3:PutBucketLogging",
                            "s3:GetEncryptionConfiguration",
                            "s3:PutEncryptionConfiguration",
                            "s3:GetBucketPublicAccessBlock",
                            "s3:PutBucketPublicAccessBlock",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::fileflow-*"
                        Sid      = "ManageS3Buckets"
                    },
                  ~ {
                      ~ Action   = [
                          - "ec2:CreateSecurityGroup",
                          - "ec2:DeleteSecurityGroup",
                          - "ec2:AuthorizeSecurityGroupIngress",
                          - "ec2:AuthorizeSecurityGroupEgress",
                          - "ec2:RevokeSecurityGroupIngress",
                          - "ec2:RevokeSecurityGroupEgress",
                          - "ec2:CreateTags",
                          - "ec2:DeleteTags",
                          + "elasticache:CreateCacheSubnetGroup",
                          + "elasticache:DeleteCacheSubnetGroup",
                          + "elasticache:ModifyCacheSubnetGroup",
                          + "elasticache:CreateReplicationGroup",
                          + "elasticache:DeleteReplicationGroup",
                          + "elasticache:ModifyReplicationGroup",
                          + "elasticache:AddTagsToResource",
                          + "elasticache:RemoveTagsFromResource",
                          + "elasticache:CreateCacheParameterGroup",
                          + "elasticache:DeleteCacheParameterGroup",
                          + "elasticache:ModifyCacheParameterGroup",
                          + "elasticache:DescribeReplicationGroups",
                        ]
                      ~ Resource = [
                          - "arn:aws:ec2:ap-northeast-2:646886795421:security-group/*",
                          - "arn:aws:ec2:ap-northeast-2:646886795421:vpc/*",
                        ] -> "*"
                      ~ Sid      = "ManageSecurityGroups" -> "ManageElastiCache"
                        # (1 unchanged attribute hidden)
                    },
                  - {
                      - Action   = [
                          - "elasticache:CreateCacheSubnetGroup",
                          - "elasticache:DeleteCacheSubnetGroup",
                          - "elasticache:ModifyCacheSubnetGroup",
                          - "elasticache:CreateReplicationGroup",
                          - "elasticache:DeleteReplicationGroup",
                          - "elasticache:ModifyReplicationGroup",
                          - "elasticache:AddTagsToResource",
                          - "elasticache:RemoveTagsFromResource",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ManageElastiCache"
                    },
                    {
                        Action   = [
                            "sqs:CreateQueue",
                            "sqs:DeleteQueue",
                            "sqs:SetQueueAttributes",
                            "sqs:TagQueue",
                            "sqs:UntagQueue",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:sqs:ap-northeast-2:646886795421:*"
                        Sid      = "ManageSQS"
                    },
                    # (4 unchanged elements hidden)
                    {
                        Action   = [
                            "ecr:CreateRepository",
                            "ecr:DeleteRepository",
                            "ecr:PutLifecyclePolicy",
                            "ecr:DeleteLifecyclePolicy",
                            "ecr:SetRepositoryPolicy",
                            "ecr:DeleteRepositoryPolicy",
                            "ecr:TagResource",
                            "ecr:UntagResource",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:ecr:ap-northeast-2:646886795421:repository/*"
                        Sid      = "ManageECR"
                    },
                  ~ {
                      ~ Action   = [
                          - "elasticache:CreateCacheParameterGroup",
                          - "elasticache:DeleteCacheParameterGroup",
                          - "elasticache:ModifyCacheParameterGroup",
                          - "elasticache:DescribeReplicationGroups",
                          + "rds:CreateDBInstance",
                          + "rds:DeleteDBInstance",
                          + "rds:ModifyDBInstance",
                          + "rds:CreateDBSubnetGroup",
                          + "rds:DeleteDBSubnetGroup",
                          + "rds:CreateDBParameterGroup",
                          + "rds:DeleteDBParameterGroup",
                          + "rds:ModifyDBParameterGroup",
                          + "rds:AddTagsToResource",
                          + "rds:RemoveTagsFromResource",
                        ]
                      ~ Sid      = "ManageElastiCacheParameters" -> "ManageRDS"
                        # (2 unchanged attributes hidden)
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateVpc",
                          + "ec2:DeleteVpc",
                          + "ec2:ModifyVpcAttribute",
                          + "ec2:CreateSubnet",
                          + "ec2:DeleteSubnet",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ManageVPC"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.ecs-task-execution-kms will be destroyed
  # (because aws_iam_role_policy.ecs-task-execution-kms is not in configuration)
  - resource "aws_iam_role_policy" "ecs-task-execution-kms" {
      - id     = "atlantis-ecs-task-execution-prod:atlantis-ecs-task-execution-kms" -> null
      - name   = "atlantis-ecs-task-execution-kms" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "kms:Decrypt",
                          - "kms:DescribeKey",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ap-northeast-2:646886795421:key/fb74c860-dfb9-498f-9937-976a098b103c"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "atlantis-ecs-task-execution-prod" -> null
    }

  # aws_iam_role_policy.ecs-task-execution-secrets will be destroyed
  # (because aws_iam_role_policy.ecs-task-execution-secrets is not in configuration)
  - resource "aws_iam_role_policy" "ecs-task-execution-secrets" {
      - id     = "atlantis-ecs-task-execution-prod:atlantis-ecs-task-execution-secrets" -> null
      - name   = "atlantis-ecs-task-execution-secrets" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt",
                          - "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "atlantis-ecs-task-execution-prod" -> null
    }

  # aws_iam_role_policy_attachment.atlantis-task-execution-policy will be created
  + resource "aws_iam_role_policy_attachment" "atlantis-task-execution-policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "atlantis-ecs-task-execution-prod"
    }

  # aws_iam_role_policy_attachment.ecs-task-execution-policy will be destroyed
  # (because aws_iam_role_policy_attachment.ecs-task-execution-policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecs-task-execution-policy" {
      - id         = "atlantis-ecs-task-execution-prod-20251011072359683400000003" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy" -> null
      - role       = "atlantis-ecs-task-execution-prod" -> null
    }

  # aws_kms_key.ecr will be updated in-place
  ~ resource "aws_kms_key" "ecr" {
        id                                 = "fb74c860-dfb9-498f-9937-976a098b103c"
      ~ tags                               = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "ecr-atlantis"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                           = {
          + "Team"        = "platform-team"
            # (10 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # aws_kms_key.efs will be updated in-place
  ~ resource "aws_kms_key" "efs" {
        id                                 = "16ebdf02-7634-495c-84ae-14da921267be"
      ~ tags                               = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "efs-atlantis"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                           = {
          + "Team"        = "platform-team"
            # (10 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # aws_lb.atlantis will be destroyed
  # (because aws_lb.atlantis is not in configuration)
  - resource "aws_lb" "atlantis" {
      - arn                                         = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/atlantis-prod/665f4d0af1d0e39d" -> null
      - arn_suffix                                  = "app/atlantis-prod/665f4d0af1d0e39d" -> null
      - client_keep_alive                           = 3600 -> null
      - desync_mitigation_mode                      = "defensive" -> null
      - dns_name                                    = "atlantis-prod-965898050.ap-northeast-2.elb.amazonaws.com" -> null
      - drop_invalid_header_fields                  = false -> null
      - enable_cross_zone_load_balancing            = true -> null
      - enable_deletion_protection                  = false -> null
      - enable_http2                                = true -> null
      - enable_tls_version_and_cipher_suite_headers = false -> null
      - enable_waf_fail_open                        = false -> null
      - enable_xff_client_port                      = false -> null
      - enable_zonal_shift                          = false -> null
      - id                                          = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/atlantis-prod/665f4d0af1d0e39d" -> null
      - idle_timeout                                = 60 -> null
      - internal                                    = false -> null
      - ip_address_type                             = "ipv4" -> null
      - load_balancer_type                          = "application" -> null
      - name                                        = "atlantis-prod" -> null
      - preserve_host_header                        = false -> null
      - security_groups                             = [
          - "sg-02b0ffd94dd79e5a4",
        ] -> null
      - subnets                                     = [
          - "subnet-0bd2fc282b0fb137a",
          - "subnet-0c8c0ad85064b80bb",
        ] -> null
      - tags                                        = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Application Load Balancer for Atlantis Terraform automation server"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all                                    = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Application Load Balancer for Atlantis Terraform automation server"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - vpc_id                                      = "vpc-0f162b9e588276e09" -> null
      - xff_header_processing_mode                  = "append" -> null
      - zone_id                                     = "ZWKZPGTI48KDX" -> null

      - access_logs {
          - enabled = false -> null
        }

      - connection_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-0bd2fc282b0fb137a" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0c8c0ad85064b80bb" -> null
        }
    }

  # aws_lb_listener.atlantis-http will be destroyed
  # (because aws_lb_listener.atlantis-http is not in configuration)
  - resource "aws_lb_listener" "atlantis-http" {
      - arn                                  = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/atlantis-prod/665f4d0af1d0e39d/ae9a38e85b067308" -> null
      - id                                   = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/atlantis-prod/665f4d0af1d0e39d/ae9a38e85b067308" -> null
      - load_balancer_arn                    = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/atlantis-prod/665f4d0af1d0e39d" -> null
      - port                                 = 80 -> null
      - protocol                             = "HTTP" -> null
      - routing_http_response_server_enabled = true -> null
      - tags                                 = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "HTTP listener for Atlantis ALB redirects to HTTPS"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-http-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all                             = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "HTTP listener for Atlantis ALB redirects to HTTPS"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-http-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null

      - default_action {
          - order = 1 -> null
          - type  = "redirect" -> null

          - redirect {
              - host        = "#{host}" -> null
              - path        = "/#{path}" -> null
              - port        = "443" -> null
              - protocol    = "HTTPS" -> null
              - query       = "#{query}" -> null
              - status_code = "HTTP_301" -> null
            }
        }
    }

  # aws_lb_listener.atlantis-https will be destroyed
  # (because aws_lb_listener.atlantis-https is not in configuration)
  - resource "aws_lb_listener" "atlantis-https" {
      - arn                                  = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/atlantis-prod/665f4d0af1d0e39d/f91ddbf7d4915967" -> null
      - certificate_arn                      = "arn:aws:acm:ap-northeast-2:646886795421:certificate/695d4642-371c-4d49-b442-af89992ffbd5" -> null
      - id                                   = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/atlantis-prod/665f4d0af1d0e39d/f91ddbf7d4915967" -> null
      - load_balancer_arn                    = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/atlantis-prod/665f4d0af1d0e39d" -> null
      - port                                 = 443 -> null
      - protocol                             = "HTTPS" -> null
      - routing_http_response_server_enabled = true -> null
      - ssl_policy                           = "ELBSecurityPolicy-TLS13-1-2-2021-06" -> null
      - tags                                 = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "HTTPS listener for Atlantis ALB"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-https-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all                             = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "HTTPS listener for Atlantis ALB"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-https-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/atl-20251011072359287200000001/2c46e9934484e453" -> null
          - type             = "forward" -> null
        }

      - mutual_authentication {
          - ignore_client_certificate_expiry = false -> null
          - mode                             = "off" -> null
        }
    }

  # aws_lb_target_group.atlantis will be destroyed
  # (because aws_lb_target_group.atlantis is not in configuration)
  - resource "aws_lb_target_group" "atlantis" {
      - arn                                = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/atl-20251011072359287200000001/2c46e9934484e453" -> null
      - arn_suffix                         = "targetgroup/atl-20251011072359287200000001/2c46e9934484e453" -> null
      - deregistration_delay               = "30" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/atl-20251011072359287200000001/2c46e9934484e453" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/atlantis-prod/665f4d0af1d0e39d",
        ] -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_anomaly_mitigation  = "off" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "atl-20251011072359287200000001" -> null
      - name_prefix                        = "atl-" -> null
      - port                               = 4141 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Target group for Atlantis ECS service"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all                           = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Target group for Atlantis ECS service"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-0f162b9e588276e09" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/healthz" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}

      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      - target_health_state {}
    }

  # aws_secretsmanager_secret.atlantis-github-app will be updated in-place
  ~ resource "aws_secretsmanager_secret" "atlantis-github-app" {
        id                             = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt"
        name                           = "atlantis/github-app-v2-prod"
      ~ tags                           = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "GitHub App credentials for Atlantis Terraform automation"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-github-app-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                       = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.atlantis-webhook-secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "atlantis-webhook-secret" {
        id                             = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7"
        name                           = "atlantis/webhook-secret-v2-prod"
      ~ tags                           = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "GitHub webhook secret for validating webhook requests"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-webhook-secret-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                       = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.atlantis-github-app[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_secretsmanager_secret_version" "atlantis-github-app" {
      - arn            = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt" -> null
      - id             = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt|terraform-20251012140026441300000001" -> null
      - secret_id      = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20251012140026441300000001" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # aws_secretsmanager_secret_version.atlantis-webhook-secret[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_secretsmanager_secret_version" "atlantis-webhook-secret" {
      - arn            = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7" -> null
      - id             = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7|terraform-20251012142201040100000001" -> null
      - secret_id      = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20251012142201040100000001" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # aws_security_group.atlantis-alb will be destroyed
  # (because aws_security_group.atlantis-alb is not in configuration)
  - resource "aws_security_group" "atlantis-alb" {
      - arn                    = "arn:aws:ec2:ap-northeast-2:646886795421:security-group/sg-02b0ffd94dd79e5a4" -> null
      - description            = "Security group for Atlantis Application Load Balancer" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all outbound traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-02b0ffd94dd79e5a4" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTP from allowed sources"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTPS from allowed sources"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "atlantis-alb-prod-20251011072849534000000001" -> null
      - name_prefix            = "atlantis-alb-prod-" -> null
      - owner_id               = "646886795421" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Security group for Atlantis Application Load Balancer"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-alb-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all               = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Security group for Atlantis Application Load Balancer"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-alb-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - vpc_id                 = "vpc-0f162b9e588276e09" -> null
    }

  # aws_security_group.atlantis-ecs-tasks will be destroyed
  # (because aws_security_group.atlantis-ecs-tasks is not in configuration)
  - resource "aws_security_group" "atlantis-ecs-tasks" {
      - arn                    = "arn:aws:ec2:ap-northeast-2:646886795421:security-group/sg-09eda99303e72ca2d" -> null
      - description            = "Security group for Atlantis ECS tasks" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all outbound traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-09eda99303e72ca2d" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow traffic from ALB"
              - from_port        = 4141
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-02b0ffd94dd79e5a4",
                ]
              - self             = false
              - to_port          = 4141
            },
        ] -> null
      - name                   = "atlantis-ecs-tasks-prod-20251011072853859500000002" -> null
      - name_prefix            = "atlantis-ecs-tasks-prod-" -> null
      - owner_id               = "646886795421" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Security group for Atlantis ECS tasks"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-ecs-tasks-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all               = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Security group for Atlantis ECS tasks"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-ecs-tasks-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - vpc_id                 = "vpc-0f162b9e588276e09" -> null
    }

  # aws_security_group.atlantis-efs will be destroyed
  # (because aws_security_group.atlantis-efs is not in configuration)
  - resource "aws_security_group" "atlantis-efs" {
      - arn                    = "arn:aws:ec2:ap-northeast-2:646886795421:security-group/sg-00b4a4594212637d2" -> null
      - description            = "Security group for Atlantis EFS mount targets" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all outbound traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-00b4a4594212637d2" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "NFS from ECS tasks"
              - from_port        = 2049
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-09eda99303e72ca2d",
                ]
              - self             = false
              - to_port          = 2049
            },
        ] -> null
      - name                   = "atlantis-efs-prod-20251011080725240400000001" -> null
      - name_prefix            = "atlantis-efs-prod-" -> null
      - owner_id               = "646886795421" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Security group for Atlantis EFS mount targets"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-efs-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all               = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Security group for Atlantis EFS mount targets"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-efs-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - vpc_id                 = "vpc-0f162b9e588276e09" -> null
    }

  # aws_security_group.vpc-endpoints will be destroyed
  # (because aws_security_group.vpc-endpoints is not in configuration)
  - resource "aws_security_group" "vpc-endpoints" {
      - arn                    = "arn:aws:ec2:ap-northeast-2:646886795421:security-group/sg-08366fa4751299ef2" -> null
      - description            = "Security group for VPC Interface Endpoints" -> null
      - egress                 = [] -> null
      - id                     = "sg-08366fa4751299ef2" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = "HTTPS from VPC"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "vpc-endpoint-sg" -> null
      - owner_id               = "646886795421" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Component"   = "vpc-endpoints"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Security group for VPC Interface Endpoints"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "vpc-endpoint-sg"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all               = {
          - "Component"   = "vpc-endpoints"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "Security group for VPC Interface Endpoints"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "vpc-endpoint-sg"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - vpc_id                 = "vpc-0f162b9e588276e09" -> null
    }

  # aws_vpc_endpoint.ecr-api will be updated in-place
  ~ resource "aws_vpc_endpoint" "ecr-api" {
        id                    = "vpce-0771cfdc087d31c5b"
      ~ security_group_ids    = [
          - "sg-08366fa4751299ef2",
        ] -> (known after apply)
      ~ tags                  = {
            "Component"   = "vpc-endpoints"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "ecr-api-endpoint"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Purpose"     = "ECS container image pull optimization"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all              = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_vpc_endpoint.ecr-dkr will be updated in-place
  ~ resource "aws_vpc_endpoint" "ecr-dkr" {
        id                    = "vpce-0a8c3a30df63ea53b"
      ~ security_group_ids    = [
          - "sg-08366fa4751299ef2",
        ] -> (known after apply)
      ~ tags                  = {
            "Component"   = "vpc-endpoints"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "ecr-dkr-endpoint"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Purpose"     = "ECS Docker registry access optimization"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all              = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_vpc_endpoint.logs will be updated in-place
  ~ resource "aws_vpc_endpoint" "logs" {
        id                    = "vpce-0b218cc766bee3ac8"
      ~ security_group_ids    = [
          - "sg-08366fa4751299ef2",
        ] -> (known after apply)
      ~ tags                  = {
            "Component"   = "vpc-endpoints"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "logs-endpoint"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Purpose"     = "CloudWatch Logs optimization"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all              = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_vpc_endpoint.s3 will be updated in-place
  ~ resource "aws_vpc_endpoint" "s3" {
        id                    = "vpce-00abd3a9518c62884"
      ~ tags                  = {
            "Component"   = "vpc-endpoints"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "s3-gateway-endpoint"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Purpose"     = "Cost optimization for S3 access"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all              = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_vpc_endpoint.secretsmanager will be updated in-place
  ~ resource "aws_vpc_endpoint" "secretsmanager" {
        id                    = "vpce-0d2a42aea9646d5f1"
      ~ security_group_ids    = [
          - "sg-08366fa4751299ef2",
        ] -> (known after apply)
      ~ tags                  = {
            "Component"   = "vpc-endpoints"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "secretsmanager-endpoint"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Purpose"     = "Secure secrets access from private subnets"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all              = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.atlantis_alb.aws_lb.this will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = "ipv4"
      + load_balancer_type                                           = "application"
      + name                                                         = "atlantis-prod"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-0bd2fc282b0fb137a",
          + "subnet-0c8c0ad85064b80bb",
        ]
      + tags                                                         = {
          + "Component"   = "load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Application Load Balancer atlantis-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all                                                     = {
          + "Component"   = "load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Application Load Balancer atlantis-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.atlantis_alb.aws_lb_listener.http["http"] will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Component"   = "listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "HTTP listener for atlantis-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod-http-http"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all                                                              = {
          + "Component"   = "listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "HTTP listener for atlantis-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod-http-http"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.atlantis_alb.aws_lb_listener.https["https"] will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = "arn:aws:acm:ap-northeast-2:646886795421:certificate/695d4642-371c-4d49-b442-af89992ffbd5"
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags                                                                  = {
          + "Component"   = "listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "HTTPS listener for atlantis-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod-https-https"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all                                                              = {
          + "Component"   = "listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "HTTPS listener for atlantis-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod-https-https"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.atlantis_alb.aws_lb_target_group.this["atlantis"] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "atlantis-prod-atlantis"
      + name_prefix                        = (known after apply)
      + port                               = 4141
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Component"   = "target-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Target group for atlantis-prod - atlantis"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod-atlantis"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all                           = {
          + "Component"   = "target-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Target group for atlantis-prod - atlantis"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod-atlantis"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0f162b9e588276e09"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/healthz"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.atlantis_alb_sg.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for Atlantis Application Load Balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "atlantis-alb-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis Application Load Balancer"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Type"        = "alb"
        }
      + tags_all               = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis Application Load Balancer"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Type"        = "alb"
        }
      + vpc_id                 = "vpc-0f162b9e588276e09"
    }

  # module.atlantis_alb_sg.aws_vpc_security_group_egress_rule.default[0] will be created
  + resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis Application Load Balancer"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod-default-egress"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all               = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis Application Load Balancer"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod-default-egress"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
    }

  # module.atlantis_alb_sg.aws_vpc_security_group_ingress_rule.alb-http["0.0.0.0/0"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "alb-http" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow HTTP traffic from internet"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis Application Load Balancer"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod-http-ingress-0.0.0.0-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all               = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis Application Load Balancer"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod-http-ingress-0.0.0.0-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + to_port                = 80
    }

  # module.atlantis_alb_sg.aws_vpc_security_group_ingress_rule.alb-https["0.0.0.0/0"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "alb-https" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow HTTPS traffic from internet"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis Application Load Balancer"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod-https-ingress-0.0.0.0-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all               = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis Application Load Balancer"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-alb-prod-https-ingress-0.0.0.0-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + to_port                = 443
    }

  # module.atlantis_ecr.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 tagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images after 7 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "atlantis"
    }

  # module.atlantis_ecr.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "atlantis"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Docker images for Atlantis Terraform automation server"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-atlantis"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all             = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Docker images for Atlantis Terraform automation server"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-atlantis"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = "arn:aws:kms:ap-northeast-2:646886795421:key/fb74c860-dfb9-498f-9937-976a098b103c"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.atlantis_ecr.aws_ecr_repository_policy.this[0] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:DescribeImages",
                          + "ecr:ListImages",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Sid       = "AllowPushPull"
                    },
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "AllowECSTaskExecution"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "atlantis"
    }

  # module.atlantis_ecr.aws_ssm_parameter.repository-url[0] will be created
  + resource "aws_ssm_parameter" "repository-url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "ECR repository URL for atlantis"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/ecr/atlantis-repository-url"
      + tags           = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Docker images for Atlantis Terraform automation server"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all       = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Docker images for Atlantis Terraform automation server"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.atlantis_ecs_tasks_sg.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for Atlantis ECS tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "atlantis-ecs-tasks-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-tasks-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Type"        = "custom"
        }
      + tags_all               = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-tasks-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Type"        = "custom"
        }
      + vpc_id                 = "vpc-0f162b9e588276e09"
    }

  # module.atlantis_ecs_tasks_sg.aws_vpc_security_group_egress_rule.default[0] will be created
  + resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-tasks-prod-default-egress"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all               = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-tasks-prod-default-egress"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
    }

  # module.atlantis_ecs_tasks_sg.aws_vpc_security_group_ingress_rule.custom["0"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "custom" {
      + arn                          = (known after apply)
      + description                  = "Allow traffic from ALB to ECS container"
      + from_port                    = 4141
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-tasks-prod-custom-ingress-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all                     = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-tasks-prod-custom-ingress-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + to_port                      = 4141
    }

  # module.atlantis_efs_sg.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for Atlantis EFS mount targets"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "atlantis-efs-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis EFS mount targets"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-efs-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Type"        = "custom"
        }
      + tags_all               = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis EFS mount targets"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-efs-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Type"        = "custom"
        }
      + vpc_id                 = "vpc-0f162b9e588276e09"
    }

  # module.atlantis_efs_sg.aws_vpc_security_group_egress_rule.default[0] will be created
  + resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis EFS mount targets"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-efs-prod-default-egress"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all               = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis EFS mount targets"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-efs-prod-default-egress"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
    }

  # module.atlantis_efs_sg.aws_vpc_security_group_ingress_rule.custom["0"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "custom" {
      + arn                          = (known after apply)
      + description                  = "NFS from ECS tasks"
      + from_port                    = 2049
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis EFS mount targets"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-efs-prod-custom-ingress-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all                     = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for Atlantis EFS mount targets"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-efs-prod-custom-ingress-0"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + to_port                      = 2049
    }

  # module.atlantis_logs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/atlantis-prod/application"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Component"     = "log-group"
          + "CostCenter"    = "engineering"
          + "DataClass"     = "confidential"
          + "Description"   = "CloudWatch log group for Atlantis ECS tasks"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "false"
          + "LangfuseSync"  = "disabled"
          + "Lifecycle"     = "production"
          + "LogType"       = "application"
          + "ManagedBy"     = "terraform"
          + "Name"          = "/aws/ecs/atlantis-prod/application"
          + "Owner"         = "platform-team"
          + "Project"       = "infrastructure"
          + "RetentionDays" = "7"
          + "SentrySync"    = "disabled"
          + "Service"       = "atlantis"
        }
      + tags_all          = {
          + "Component"     = "log-group"
          + "CostCenter"    = "engineering"
          + "DataClass"     = "confidential"
          + "Description"   = "CloudWatch log group for Atlantis ECS tasks"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "false"
          + "LangfuseSync"  = "disabled"
          + "Lifecycle"     = "production"
          + "LogType"       = "application"
          + "ManagedBy"     = "terraform"
          + "Name"          = "/aws/ecs/atlantis-prod/application"
          + "Owner"         = "platform-team"
          + "Project"       = "infrastructure"
          + "RetentionDays" = "7"
          + "SentrySync"    = "disabled"
          + "Service"       = "atlantis"
        }
    }

  # module.atlantis_task_execution_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "ECS task execution role for Atlantis"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "atlantis-ecs-task-execution-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "ECS task execution role for Atlantis"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-task-execution-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "ECS task execution role for Atlantis"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-task-execution-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + unique_id             = (known after apply)
    }

  # module.atlantis_task_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "ECS task role for Atlantis Terraform operations"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "atlantis-ecs-task-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "ECS task role for Atlantis Terraform operations"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-task-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "ECS task role for Atlantis Terraform operations"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-ecs-task-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + unique_id             = (known after apply)
    }

  # module.vpc_endpoints_sg.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for VPC Interface Endpoints"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "vpc-endpoint-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "vpc-endpoints"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for VPC Interface Endpoints"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-endpoint-sg"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Type"        = "vpc-endpoint"
        }
      + tags_all               = {
          + "Component"   = "vpc-endpoints"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for VPC Interface Endpoints"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-endpoint-sg"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Type"        = "vpc-endpoint"
        }
      + vpc_id                 = "vpc-0f162b9e588276e09"
    }

  # module.vpc_endpoints_sg.aws_vpc_security_group_ingress_rule.vpc-endpoint-cidr["10.0.0.0/16"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "vpc-endpoint-cidr" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/16"
      + description            = "Allow traffic from CIDR block to VPC endpoint"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Component"   = "vpc-endpoints"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for VPC Interface Endpoints"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-endpoint-sg-cidr-ingress-10.0.0.0/16"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + tags_all               = {
          + "Component"   = "vpc-endpoints"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for VPC Interface Endpoints"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-endpoint-sg-cidr-ingress-10.0.0.0/16"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
        }
      + to_port                = 443
    }

Plan: 29 to add, 15 to change, 23 to destroy.

Changes to Outputs:
  ~ atlantis_alb_arn                     = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/atlantis-prod/665f4d0af1d0e39d" -> (known after apply)
  ~ atlantis_alb_dns_name                = "atlantis-prod-965898050.ap-northeast-2.elb.amazonaws.com" -> (known after apply)
  ~ atlantis_alb_security_group_id       = "sg-02b0ffd94dd79e5a4" -> (known after apply)
  ~ atlantis_alb_zone_id                 = "ZWKZPGTI48KDX" -> (known after apply)
  + atlantis_cloudwatch_log_group_arn    = (known after apply)
  ~ atlantis_cloudwatch_log_group_name   = "/ecs/atlantis-prod" -> "/aws/ecs/atlantis-prod/application"
  ~ atlantis_ecr_repository_arn          = "arn:aws:ecr:ap-northeast-2:646886795421:repository/atlantis" -> (known after apply)
  ~ atlantis_ecr_repository_url          = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/atlantis" -> (known after apply)
  ~ atlantis_ecs_task_execution_role_arn = "arn:aws:iam::646886795421:role/atlantis-ecs-task-execution-prod" -> (known after apply)
  ~ atlantis_ecs_task_role_arn           = "arn:aws:iam::646886795421:role/atlantis-ecs-task-prod" -> (known after apply)
  ~ atlantis_ecs_tasks_security_group_id = "sg-09eda99303e72ca2d" -> (known after apply)
  ~ atlantis_target_group_arn            = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/atl-20251011072359287200000001/2c46e9934484e453" -> (known after apply)
  + atlantis_target_group_arns           = {
      + atlantis = (known after apply)
    }
  ~ atlantis_task_definition_arn         = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/atlantis-prod:8" -> (known after apply)
  ~ atlantis_task_definition_revision    = 8 -> (known after apply)
  ~ vpc_endpoint_sg_id                   = "sg-08366fa4751299ef2" -> (known after apply)

```

</details>

*Pushed by: @ryu-qqq, Action: `pull_request`*